docs/posts/2015-01-13-sublime-text-build-for-multimarkdown.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sublime Text Build for MultiMarkdown</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Sublime Text Build for MultiMarkdown</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
I added some variants to Brett Terpstra&rsquo;s Marked.sublime-build file, which is part of the Marked <a href="http://brettterpstra.com/introducing-the-marked-bonus-pack/">Bonus Pack</a>. It adds options for building tex, opml, and odf files. To build a tex file, open the command palette and search for &ldquo;MMD to LaTeX.&rdquo; The file is saved as &ldquo;Marked.sublime-build&rdquo; in <code>/Users/YourUserName/Library/Application Support/Sublime Text 3/Packages</code>. Here is the complete build file:
</p>


<pre class="example" id="orgf3b5c60">
{
	"cmd": ["open","-a","/Applications/Marked.app","$file"],
	"selector": "text.html.markdown",

	"variants": [
		{
			"cmd": ["mmd2tex", "$file"],
			"path": "/usr/local/bin",
			"name": "MMD to LaTeX"
		},

		{
			"cmd": ["mmd2odf", "$file"],
			"path": "/usr/local/bin",
			"name": "MMD to ODF"
		},

		{
			"cmd": ["mmd2opml", "$file"],
			"path": "/usr/local/bin",
			"name": "MMD to OPML"
		}

	]
}
</pre>

<p>
Happy New Year!
</p>


<div class="tagline" id="org61020ad">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
